benchmarks/benchmark_results.txt
=== Full Benchmark Suite — Wed Jul  8 12:19:05 AM +0630 2026 ===
System: Linux 7.0.14-201.fc44.x86_64 x86_64
CPU: 4 cores

Running 10s test @ http://127.0.0.1:8000/www/main.html
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   358.19us  233.56us   5.42ms   91.31%
    Req/Sec    13.52k     0.88k   15.52k    70.79%
  Latency Distribution
     50%  309.00us
     75%  411.00us
     90%  539.00us
     99%    1.30ms
  271742 requests in 10.10s, 36.54MB read
Requests/sec:  26904.88
Transfer/sec:      3.62MB

Running 15s test @ http://127.0.0.1:8000/www/main.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.46ms  681.61us  16.60ms   82.09%
    Req/Sec     7.12k   476.65     9.04k    68.00%
  Latency Distribution
     50%    3.37ms
     75%    3.73ms
     90%    4.14ms
     99%    5.34ms
  425423 requests in 15.02s, 57.21MB read
Requests/sec:  28323.34
Transfer/sec:      3.81MB

Running 15s test @ http://127.0.0.1:8000/www/main.html
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.81ms    1.45ms  32.63ms   80.89%
    Req/Sec     7.00k   348.48     7.76k    68.17%
  Latency Distribution
     50%   17.69ms
     75%   18.44ms
     90%   19.23ms
     99%   22.66ms
  418728 requests in 15.05s, 56.31MB read
Requests/sec:  27824.58
Transfer/sec:      3.74MB

Running 10s test @ http://127.0.0.1:8000/www/main.html
  4 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.34ms    2.88ms  59.58ms   87.43%
    Req/Sec     7.07k   399.18     8.65k    74.25%
  Latency Distribution
     50%   35.07ms
     75%   36.36ms
     90%   37.77ms
     99%   46.17ms
  281564 requests in 10.07s, 37.86MB read
Requests/sec:  27958.55
Transfer/sec:      3.76MB